package com.example.doctorpocket_;

import android.content.Intent;
import android.media.MediaPlayer;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;

public class ProtectionActivity extends AppCompatActivity {
    String [] names ={"نزلات البرد","الصداع النصفي","الذبحة الصدرية","الالتهاب الرئوي","الانيميا","امراض القولون","الفشل الكلوي","الروماتيزم"};

    private String [] information={"تعرف نزلات البرد بأنها إصابة فيروسية بالجزء العلوي للجهاز التنفسي و هي مرض معد ينتقل من الشخص المصاب للشخص السليم \n "+
            " ومن أعراض نزلات البرد :\n"+"-العطس \n"+"-رشح من الأنف \n"+"-احتقان الحلق \n"+"- الصداع \n"+"- السعال \n"+"- بحة الصوت \n"
            , "الصداع النصفي هو مرض مزمن يتجلى في حالات متكررة من الصداع،وعادة ما يصيب نصف الرأس.  مصحوبا بظواهر جسدية ونفسية، أيضا. وهو مرض شائع لدى حوالي 12 % من الاشخاص.\n"+
            "ومن أعراض الصداع النصفي: \n"+"- اضطراب الكلام \n"+"- انعدام الإحساس (الخدر)\n"+"- اضطراب في جهة واحدة، أو في كلتا الجهتين، من مجال الرؤية \n"
            , " هي نوع من الأوجاع في الصدر،أو من الشعور بعدم الراحة، الناجم عن انخفاض في تدفق الدم إلى عضلة القلب. \n"+
            "والذبحة هي عَرَض لمرض في الشريان التاجي. فعندما لا تحصل عضلة القلب على كمية كافية من الدم الغني بالأكسجين، من الممكن حدوث ألم في الصدر. وتوصف الذبحة، بشكل عام، بأنها الشعور بعَصْ، ضغط، ثِقل، شدّ أو ألم في الصدر. ويعاني العديد من الأشخاص من الذبحة، إذ يشيرون إلى كونهم يشعرون بـوقوف شيء ما على صدرهم."+
            "ومن أعراض الذبحة الصدرية : \n"+"- الألم في الصدر \n"+"- الإحساس بعدم راحة في الصدر \n"+"وقد يصاحبهم :\n"+"-الغثيان\n"+"- ضيق التنفس \n"+"-  التعرق \n"+"- الدوخة \n"
            ,"هو تلوث في الرئتين قد يولد شعورا سيئا جدا\n"+"و يسبب الالتهاب الرئوي السعال، الحمّى (ارتفاع درجة حرارة الجسم) وصعوبات في التنفس. \n"+"ومن أعراض الالتهاب الرئوي : \n"+"- الارتعاد والقشعريرة، \n"
            +"- الغثيان والقيء. \n"   +"- دقات قلب سريعة. \n"+"- صعوبات في التنفس.ة. \n"
            ,"فقر الدم هو حالة لا يوجد فيها لديك ما يكفي من كريات الدم الحمراء السليمة لحمل الأكسجين الكافي إلى أنسجة الجسم. وقد يجعلك فقر الدم تشعر بالإعياء والضعف. \n"
            +"توجد عدة أنواع من فقر الدم، ولكل منها أسبابه. قد يكون فقر الدم مؤقتًا أو طويل الأمد، ويمكن أن تتراوح شدته من الخفيف إلى الحاد. يرجى الرجوع إلى الطبيب إذا كنت تشك في أنك تعاني فقر الدم لأنه يمكن أن يكون علامة تحذير من مرض خطير. \n"
            +"من أعراض الانيميا : \n"+"- الإرهاق \n"
            +"- الضعف \n" +"- شحوب أو اصفرار الجلد \n"+"-ضربات قلب غير منتظمة \n"+"-ضيق النفس \n"
            +"-دوخة أو دوارًا \n"+"-ألم الصدر \n"+"-برودة اليدين والقدمين \n"+"-الصداع \n"
            ,"امراض القولون واهمها متلازمة القولون العصبي (IBS) هي حالة شائعة جدا، والتي تتراوح نسبة انتشارها في العالم الصناعي من 10% إلى 20 %.\n" +
            "\n" +
            "المصابون بأمراض القولون يعانون عادة من الام في البطن وتغييرات في التغوط مثل التغوط غير المنتظم، الإمساك أو الإسهال. قد تكون هناك أعراض إضافية مثل انتفاخات البطن، الحاح التغوط والبراز المخاطي."
            +"هي حالة صحية مزمنة وشائعة تصيب الأمعاء الغليظة (القولون)، وتسبب تقلصات وانتفاخًا في البطن، بالإضافة لتغير في نمط حركة التجويف المعوي، ويمكن أن يؤثر في أي شخص في أي عمر. كما تختلف أعراضها بين المصابين بها، وتصنف ضمن اضطرابات الجهاز الهضمي الوظيفية. \n"
            +"حتى الآن لا يوجد سبب واضح للإصابة به، ولكن يُعتقد أن سببه اجتماع عدة عوامل معًا، منها:\n" +
            "خلل بين الإشارات العصبية في الجهاز الهضمي والدماغ. \n"
            ,"تقوم الكلى بتصفية الدم وإفراز الفضلات وفائض السوائل إلي البول.عند إصابة أداء الكلى تتراكم الفضلات وفائض السوائل في الجسم.الامر الذي قد يشكل خطرا \n"
            +"يكون التدهور في أداء الكلى بطيئا حيث تحتدم الاعراض كلما تفاقم الفشل الكلوي المزمن.احيانا لا يتم تمييز اية اعراض للمرض في المراحل الاولى ولذلك فهي تكتشف فقط في مراحل متأخرة \n "
            +"ومن أعراض الفشل الكلوي : \n"+"- انخفاض كمية البول \n -غثيان وتقيؤ \n - نقص شهية \n - تعب وضعف \n - صعوبات بالنوم \n - انخفاض حدة التفكير \n - انقباض العضل "
            , "يضم مصطلح الروماتيزم (الاضطرابات العضلية الهيكلية) طيفًا واسعًا من الأمراض والمشاكل الصحية عن مهاجمة الجهاز المناعي في الجسم الأنسجة السليمة فيه \n"
    +"ومن أعراض الروماتيزم : \n"+"الشعور بالألم عند تحريك المنطقة المُصابة. تحسّن حالة المريض عند تدفئة المنطقة المُتأثّرة. الشعور بالألم عند لمس المنطقة المُصابة. تيبّس الأجزاء المُتأثّرة خاصة في حال عدم تحريكها لفترة طويلة. الشعور بالألم أو الانزعاج في مفصل واحد أو أكثر بما في ذلك فقرات العمود الفقريّ. تدهور حالة الشخص عند التّعرض لبعض الظروف المناخيّة المُختلفة، وخاصة انخفاض الضّغط الجويّ أو ارتفاع الرُّطوبة. الشعور بتحسُّن الأعراض بعد ممارسة التّمارين الرياضيّة الخفيفة، " +
            "-وازدياد الأعراض سوءاً عند ممارسة التّمارين الرياضيّة الشديدة."};

    int [] pictures={R.drawable.sneezyguyy, R.drawable.headache,R.drawable.heartattack,R.drawable.pneumo,R.drawable.animia,R.drawable.colon,R.drawable.kid,R.drawable.roma};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        getSupportActionBar().hide();
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_protection);

        ArrayAdapter adapt=new ArrayAdapter<>(ProtectionActivity.this,android.R.layout.simple_list_item_1,names);
        ListView list=findViewById(R.id.LV);
        list.setAdapter(adapt);

        list.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {

                Intent in = new Intent(ProtectionActivity.this, AmradActivity.class);
                in.putExtra("index",information[i]);
                if(i<pictures.length)
                    in.putExtra("clicked",pictures[i]);
                startActivity(in);

            }
        });

    }
}
